---
kind: method
id: M:Autodesk.Revit.DB.Architecture.BalusterPattern.RemoveBaluster(System.Int32)
source: html/b22685f5-1a7e-422c-8439-35504b96d3fd.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPattern.RemoveBaluster Method

Removes a baluster from the main baluster pattern.

## Syntax (C#)
```csharp
public void RemoveBaluster(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - Baluster index.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The index index is out of range.